#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::435552912911:policy/iam_policy_lambda_logging_function]
aws_iam_role.lambda_exec_role: Refreshing state... [id=lambda_exec]
aws_s3_bucket_object.object: Refreshing state... [id=helloWorldHandler.zip]
aws_dynamodb_table.terraform-state: Refreshing state... [id=terraform-state]
aws_cloudwatch_log_group.example: Refreshing state... [id=/aws/lambda/minimal_lambda_function]
aws_api_gateway_rest_api.api: Refreshing state... [id=459nr2vw66]
aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=lambda_exec-20210907220116614300000001]
aws_api_gateway_resource.resource: Refreshing state... [id=dcrhgj]
aws_lambda_function.lambda_function: Refreshing state... [id=minimal_lambda_function]
aws_api_gateway_method.method: Refreshing state... [id=agm-459nr2vw66-dcrhgj-GET]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-459nr2vw66-dcrhgj-GET]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_deployment.example: Refreshing state... [id=tmvult]
aws_api_gateway_stage.example: Refreshing state... [id=ags-459nr2vw66-prod]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_dynamodb_table.terraform-state has been changed
  ~ resource "aws_dynamodb_table" "terraform-state" {
        id             = "terraform-state"
        name           = "terraform-state"
      + tags           = {}
        # (7 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_s3_bucket_object.lambda_zip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_s3_bucket_object" "lambda_zip"  {
      + body                          = (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + cache_control                 = (known after apply)
      + content_disposition           = (known after apply)
      + content_encoding              = (known after apply)
      + content_language              = (known after apply)
      ~ content_length                = 616 -> (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "e76c0245c4ab7be8a363e5833fcdfec2" -> (known after apply)
      + expiration                    = (known after apply)
      + expires                       = (known after apply)
      ~ id                            = "kpinetwork-backend/helloWorldHandler.zip" -> (known after apply)
      ~ last_modified                 = "Tue, 07 Sep 2021 22:01:15 UTC" -> (known after apply)
      ~ metadata                      = {} -> (known after apply)
      + object_lock_legal_hold_status = (known after apply)
      + object_lock_mode              = (known after apply)
      + object_lock_retain_until_date = (known after apply)
      + server_side_encryption        = (known after apply)
      + sse_kms_key_id                = (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
      ~ tags                          = {} -> (known after apply)
      + version_id                    = (known after apply)
      + website_redirect_location     = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "minimal_lambda_function"
      ~ last_modified                  = "2021-09-07T22:09:09.964+0000" -> (known after apply)
      ~ source_code_hash               = "+4ovvjtToF4PAvvflUqIINB4c02fCMvMEYfoUnkspyk=" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket_object.object will be updated in-place
  ~ resource "aws_s3_bucket_object" "object" {
      ~ etag               = "e76c0245c4ab7be8a363e5833fcdfec2" -> "8075283234183ca82a265c1369e6c886"
        id                 = "helloWorldHandler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on lambda.tf line 27, in data "aws_s3_bucket_object" "lambda_zip":
  27:     "aws_s3_bucket_object.object"]

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ridouku, Action: `pull_request`*